
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	// + Кристина 27.01.2026 Типовой механизм расчета отключен
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	// - Кристина 27.01.2026 Типовой механизм расчета отключен
	
	// + Кристина 27.01.2026 Добавлен новый механизм расчета с учетом скидки
	СуммаБезСкидки =  ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	СуммаСкидки = СуммаБезСкидки * Объект.ДЗ_СогласованнаяСкидка / 100;
	ТекущиеДанные.Сумма =  СуммаБезСкидки - СуммаСкидки;
	// - Кристина 27.01.2026 Добавлен новый механизм расчета с учетом скидки
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти   

// + Кристина 27.01.2026 Обработчик изменения согласованной скидки
&НаКлиенте
Процедура ДЗ_ПриИзмененииСогласованнойСкидки(Элемент) 
	ДЗ_ПересчитатьДокументСВопросом();
КонецПроцедуры  

&НаКлиенте
Процедура ДЗ_ПересчитатьДокументСВопросом()
	
	Если Объект.Товары.Количество() = 0 и Объект.Услуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оп = Новый ОписаниеОповещения("ДЗ_ВыполнитьПослеВопросаПересчета", ЭтотОбъект); 
	
	ПоказатьВопрос(Оп, "Выполнить пересчет суммы в табличных частях?", РежимДиалогаВопрос.ДаНет);


КонецПроцедуры

 
&НаКлиенте
Процедура ДЗ_РасчитатьДокумент()
	Для Каждого ТекущиеДанные из Объект.Товары Цикл
		РассчитатьСуммуСтроки(ТекущиеДанные)
	КонецЦикла;
	
	Для Каждого ТекущиеДанные из Объект.Услуги Цикл
		РассчитатьСуммуСтроки(ТекущиеДанные)
	КонецЦикла;
КонецПроцедуры


&НаКлиенте 
Процедура ДЗ_ВыполнитьПослеВопросаПересчета(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
    ДЗ_РасчитатьДокумент();
КонецПроцедуры 

&НаКлиенте
Процедура ДЗ_ПересчитатьДокумент(Команда)
	ДЗ_РасчитатьДокумент();
КонецПроцедуры

// - Кристина 27.01.2026 Обработчик изменения согласованной скидки

#КонецОбласти
