
Процедура ДобавитьНаФормуЭлементы(Форма) Экспорт  
	ИмяФормы = Форма.ИмяФормы;   
	ДобавлятьСкидку = Ложь; 
	Родитель = Неопределено;
	ЭлементПеред = Неопределено;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		Родитель = Форма.Элементы.ГруппаШапкаПраво;
		ДобавлятьСкидку = Истина;
		ЭтоФормаДокумента = Истина;
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ЭлементПеред = Форма.Элементы.СуммаДокумента;
		ЭтоФормаДокумента = Истина;
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ЭлементПеред = Форма.Элементы.СуммаДокумента;
		ЭтоФормаДокумента = Истина;
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		Родитель = Форма.Элементы.ГруппаШапкаПраво;
		ЭтоФормаДокумента = Истина;
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		Родитель = Форма.Элементы.ГруппаШапкаПраво;
		ЭтоФормаДокумента = Истина;
	Иначе
		ЭтоФормаДокумента = Ложь;
	КонецЕсли; 
	
	
	Если не ЭтоФормаДокумента Тогда
		Возврат;
	КонецЕсли;
	
	Если Родитель <> Неопределено Тогда
		ДобавитьЭлементыФормыВГруппуРодитель(Форма, ДобавлятьСкидку, Родитель);
	КонецЕсли;
	Если ЭлементПеред <> Неопределено Тогда
		ДобавитьЭлементыФормыПередЭлементом(Форма, ДобавлятьСкидку, ЭлементПеред);
	КонецЕсли;

	

                  
КонецПроцедуры  

Процедура ДобавитьЭлементыФормыВГруппуРодитель(Форма, ДобавлятьСкидку, Родитель)
	
		
	НовыйЭлемент = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Родитель);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";   
	
	Если ДобавлятьСкидку Тогда  
		//Создания обычной группы без отображения
		ГруппаСкидка = Форма.Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"),Родитель);
		ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСкидка.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаСкидка.ОтображатьЗаголовок = ЛОЖЬ; 
		ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		НовыйЭлемент = Форма.Элементы.Добавить("ДЗ_СогласованнаяСкидка", Тип("ПолеФормы"), ГруппаСкидка);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка"; 
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "ДЗ_ПриИзмененииСогласованнойСкидки"); 
		
		//Создание команды
		НоваяКоманда = Форма.Команды.Добавить("ДЗ_ПересчитатьДокумент");
		НоваяКоманда.Заголовок = "Пересчитать документ";
		НоваяКоманда.Действие = "ДЗ_ПересчитатьДокумент"; 
		
		//Создание кнопки
		НовыйЭлемент = Форма.Элементы.Добавить("ДЗ_ПересчитатьДокумент", Тип("КнопкаФормы"),ГруппаСкидка);
		НовыйЭлемент.Заголовок = "Пересчитать документ";
		НовыйЭлемент.ИмяКоманды = "ДЗ_ПересчитатьДокумент";
		НовыйЭлемент.Картинка = БиблиотекаКартинок.Обновить;
		НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЭлементыФормыПередЭлементом(Форма, ДобавлятьСкидку, ЭлементПеред)
	
		
	НовыйЭлемент = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,ЭлементПеред);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";   
	
КонецПроцедуры
